def 다우닝(mine, yours):
    n = len(mine)
    if n == 0 or n == 1:
        return 'D'
    else:
        상대의총협력횟수 = 0
        상대가내협력뒤에협력한횟수=0
        상대가내배반뒤에협력한횟수=0
        for i in range(1, n):
            if yours[i] == 'C':
                상대의총협력횟수 += 1
                if mine[i-1] == 'C':
                    상대가내협력뒤에협력한횟수 += 1
                else:
                    상대가내배반뒤에협력한횟수 += 1
        if 상대의총협력횟수 == 0:
            return 'D'
        상대가내협력뒤에협력할확률 = 상대가내협력뒤에협력한횟수/상대의총협력횟수
        상대가내배반뒤에협력할확률 = 상대가내배반뒤에협력한횟수/상대의총협력횟수
        if 상대가내협력뒤에협력할확률 > 상대가내배반뒤에협력할확률:
            return 'C'
        else:
            return 'D'
